"""
Реализовать генератор с помощью функции с ключевым словом yield,
создающим очередное значение. При вызове функции должен создаваться
объект-генератор. Функция должна вызываться следующим образом: for el in fact(n).
Функция отвечает за получение факториала числа, а в цикле необходимо
выводить только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n.
Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""


def factorial(k):
    if k == 0 or k == 1:
        return 1
    return factorial(k - 1) * k


def fact(num):
    yield [factorial(num) for num in range(1, num + 1)]


n = int(input())
for el in fact(n):
    print(el)
